# Credit Card Fraud Detection

## Importing the libraries

In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns

# modeling 
from sklearn.model_selection import train_test_split
from sklearn.metrics import confusion_matrix, classification_report, accuracy_score, f1_score, auc, roc_curve, \
    precision_recall_curve, precision_score, recall_score
from sklearn.preprocessing import StandardScaler
from sklearn.linear_model import LogisticRegression

In [4]:
data = pd.read_csv('Credit_card.csv')
data.head()

,Ind_ID,GENDER,Car_Owner,Propert_Owner,CHILDREN,Annual_income,Type_Income,EDUCATION,Marital_status,Housing_type,Birthday_count,Employed_days,Mobile_phone,Work_Phone,Phone,EMAIL_ID,Type_Occupation,Family_Members
0,5008827,M,Y,Y,0,180000.0,Pensioner,Higher education,Married,House / apartment,-18772.0,365243,1,0,0,0,NaN,2
1,5009744,F,Y,N,0,315000.0,Commercial associate,Higher education,Married,House / apartment,-13557.0,-586,1,1,1,0,NaN,2
2,5009746,F,Y,N,0,315000.0,Commercial associate,Higher education,Married,House / apartment,NaN,-586,1,1,1,0,NaN,2
3,5009749,F,Y,N,0,NaN,Commercial associate,Higher education,Married,House / apartment,-13557.0,-586,1,1,1,0,NaN,2
4,5009752,F,Y,N,0,315000.0,Commercial associate,Higher education,Married,House / apartment,-13557.0,-586,1,1,1,0,NaN,2

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1548 entries, 0 to 1547
Data columns (total 18 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Ind_ID           1548 non-null   int64
 1   GENDER           1541 non-null   object
 2   Car_Owner        1548 non-null   object
 3   Propert_Owner    1548 non-null   object
 4   CHILDREN         1548 non-null   int64
 5   Annual_income    1525 non-null   float64
 6   Type_Income      1548 non-null   object
 7   EDUCATION        1548 non-null   object
 8   Marital_status   1548 non-null   object
 9   Housing_type     1548 non-null   object
 10  Birthday_count   1526 non-null   float64
 11  Employed_days    1548 non-null   int64
 12  Mobile_phone     1548 non-null   int64
 13  Work_Phone       1548 non-null   int64
 14  Phone            1548 non-null   int64
 15  EMAIL_ID         1548 non-null   int64
 16  Type_Occupation  1060 non-null   object
 17  Family_Members   1548 non-null   int64
dtypes: float64(2), int64(8), object(8)
memory usage: 217.8+ KB

In [6]:
data.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
Ind_ID,1548.0,NaN,NaN,NaN,5078920.351421,41717.587742,5008827.0,5045069.75,5078841.5,5115673.0,5150412.0
GENDER,1541,2,F,973,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Car_Owner,1548,2,N,924,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Propert_Owner,1548,2,Y,1010,NaN,NaN,NaN,NaN,NaN,NaN,NaN
CHILDREN,1548.0,NaN,NaN,NaN,0.412791,0.776691,0.0,0.0,0.0,1.0,14.0
Annual_income,1525.0,NaN,NaN,NaN,191399.32623,113252.997656,33750.0,121500.0,166500.0,225000.0,1575000.0
Type_Income,1548,4,Working,798,NaN,NaN,NaN,NaN,NaN,NaN,NaN
EDUCATION,1548,5,Secondary / secondary special,1031,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Marital_status,1548,5,Married,1049,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Housing_type,1548,6,House / apartment,1380,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Birthday_count,1526.0,NaN,NaN,NaN,-16040.342071,4229.503202,-24946.0,-19553.0,-15661.5,-12417.0,-7705.0
Employed_days,1548.0,NaN,NaN,NaN,59364.689922,137808.062701,-14887.0,-3174.5,-1565.0,-431.75,365243.0
Mobile_phone,1548.0,NaN,NaN,NaN,1.0,0.0,1.0,1.0,1.0,1.0,1.0
Work_Phone,1548.0,NaN,NaN,NaN,0.20801,0.406015,0.0,0.0,0.0,0.0,1.0
Phone,1548.0,NaN,NaN,NaN,0.309432,0.462409,0.0,0.0,0.0,1.0,1.0
EMAIL_ID,1548.0,NaN,NaN,NaN,0.092377,0.289651,0.0,0.0,0.0,0.0,1.0
Type_Occupation,1060,18,Laborers,268,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Family_Members,1548.0,NaN,NaN,NaN,2.161499,0.947772,1.0,2.0,2.0,3.0,15.0